<h1>Привет от php</h1>

<?php
	
	$booksList = array(
		"Рей Брэдбери" => ["451° по Фаренгейту", "Вино из одуванчиков"],
		"Грегори Дэвид Робертс" => ["Шантарам", "Тень горы"],
		"Джордж Оруэлл" => "1984",
		"Михаил Афанасьевич Булгаков" => "Мастер и Маргарита",
		"Эрих Мария Ремарк" => "Три товарища",
		"Оскар Уайльд" => "Портрет Дориана Грея",
		"Даниел Киз" => "Цветы для Элджернона",
		"Джером Д. Сэлинджер" => "Над пропастью во ржи",
		"Антуан де Сент-Экзюпери" => "Маленький принц",
		"Лев Толстой" => "Анна Каренина",
		"Габриэль Гарсиа Маркес" => "Сто лет одиночества",
		"Айн Рэнд" => "Атлант расправил плечи"
	);
	

	echo "<ol>";

	foreach ($booksList as $autor => $title) {
		if ( is_array($title) ) {
			echo "<li>$autor:";
			echo "<ol>";
			foreach ($title as $book) {
				echo "<li>$book</li>";
			}
			echo "</ol>";
			echo "</li>";
		} else {
			echo "<li>$autor: $title</li>";
		}
	 }

	echo "</ol>";

	

?>